# 텐서플로우(google) - 산업용
* 이미지 관련 라이브러리
* keras를 이용해 코딩이 쉬움
* 순차적 sequentional, functional, class

# 파이토치(meta) - 연구용
* 자연어 관련 라이브러리
* 허깅페이스, 랭체인 
* class

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
print(np.__version__)

1.26.4

In [4]:
data = pd.read_csv("https://raw.githubusercontent.com/haram4th/ablearn/main/Taitanic_train.csv")
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [5]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
data = data[['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Embarked']]
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S

In [8]:
data['family'] = data['SibSp'] + data['Parch']
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked  family
0         0       3    male  22.0      1      0        S       1
1         1       1  female  38.0      1      0        C       1
2         1       3  female  26.0      0      0        S       0
3         1       1  female  35.0      1      0        S       1
4         0       3    male  35.0      0      0        S       0

In [9]:
data = data.drop(['SibSp', 'Parch'], axis=1)
data.head()

   Survived  Pclass     Sex   Age Embarked  family
0         0       3    male  22.0        S       1
1         1       1  female  38.0        C       1
2         1       3  female  26.0        S       0
3         1       1  female  35.0        S       1
4         0       3    male  35.0        S       0

In [10]:
data['Age'] = data['Age'].fillna(data['Age'].mean())

In [13]:
data['Embarked'].mode()[0]

'S'

In [14]:
data['Embarked'] = data['Embarked'].fillna(data['Embarked'].mode()[0])

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   Embarked  891 non-null    object
 5   family    891 non-null    int64
dtypes: float64(1), int64(3), object(2)
memory usage: 41.9+ KB

In [17]:
data.head()

   Survived  Pclass     Sex   Age Embarked  family
0         0       3    male  22.0        S       1
1         1       1  female  38.0        C       1
2         1       3  female  26.0        S       0
3         1       1  female  35.0        S       1
4         0       3    male  35.0        S       0

In [18]:
data = pd.get_dummies(data, drop_first=True)
data.head()

   Survived  Pclass   Age  family  Sex_male  Embarked_Q  Embarked_S
0         0       3  22.0       1      True       False        True
1         1       1  38.0       1     False       False       False
2         1       3  26.0       0     False       False        True
3         1       1  35.0       1     False       False        True
4         0       3  35.0       0      True       False        True

In [19]:
X = data.drop('Survived', axis=1)
y = data['Survived']

In [21]:
from sklearn.preprocessing import StandardScaler

In [22]:
ss = StandardScaler()
X_scaled = ss.fit_transform(X)
X_scaled = pd.DataFrame(X_scaled, columns=X.columns)
X_scaled.head()

     Pclass       Age    family  Sex_male  Embarked_Q  Embarked_S
0  0.827377 -0.592481  0.059160  0.737695   -0.307562    0.615838
1 -1.566107  0.638789  0.059160 -1.355574   -0.307562   -1.623803
2  0.827377 -0.284663 -0.560975 -1.355574   -0.307562    0.615838
3 -1.566107  0.407926  0.059160 -1.355574   -0.307562    0.615838
4  0.827377  0.407926 -0.560975  0.737695   -0.307562    0.615838

In [24]:
from sklearn.model_selection import train_test_split

In [25]:
X_train, X_test, y_train, y_test = train_test_split(X_scaled, y, test_size=0.7, random_state=10)

In [26]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import classification_report

In [31]:
dtc = DecisionTreeClassifier(max_depth=3, random_state=10)
dtc.fit(X_train, y_train)
pred = dtc.predict(X_test)
print(classification_report(y_test, pred))

              precision    recall  f1-score   support

           0       0.82      0.90      0.85       386
           1       0.80      0.67      0.73       238

    accuracy                           0.81       624
   macro avg       0.81      0.78      0.79       624
weighted avg       0.81      0.81      0.81       624

In [30]:
# for i in range(1, 20):
#     dtc = DecisionTreeClassifier(max_depth=i, random_state=10)
#     dtc.fit(X_train, y_train)
#     pred = dtc.predict(X_test)
#     print(i)
#     print(classification_report(y_test, pred))

# Tensorflow Sequential API를 사용한 순차적 모델

In [32]:
import tensorflow as tf
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense

## 딥러닝 신경망 모델 정의

In [35]:
X_train

       Pclass       Age    family  Sex_male  Embarked_Q  Embarked_S
247 -0.369365 -0.438572  0.679295 -1.355574   -0.307562    0.615838
5    0.827377  0.000000 -0.560975  0.737695    3.251373   -1.623803
563  0.827377  0.000000 -0.560975  0.737695   -0.307562    0.615838
636  0.827377  0.177063 -0.560975  0.737695   -0.307562    0.615838
145 -0.369365 -0.823344  0.679295  0.737695   -0.307562    0.615838
..        ...       ...       ...       ...         ...         ...
369 -1.566107 -0.438572 -0.560975 -1.355574   -0.307562   -1.623803
320  0.827377 -0.592481 -0.560975  0.737695   -0.307562    0.615838
527 -1.566107  0.000000 -0.560975  0.737695   -0.307562    0.615838
125  0.827377 -1.362024  0.059160  0.737695   -0.307562   -1.623803
265 -0.369365  0.484880 -0.560975  0.737695   -0.307562    0.615838

[267 rows x 6 columns]

In [34]:
X_train.shape[1]

6

In [36]:
# 신경망 모델 정의
model = Sequential()
model.add(Dense(32, input_dim=X_train.shape[1], activation='relu')) # 입력층, input_dim: 독립변수의 컬럼 수
model.add(Dense(64, activation='relu')) # 은닉층 1
model.add(Dense(32, activation='relu')) # 은닉층 2
model.add(Dense(16, activation='relu')) # 은닉층 3
model.add(Dense(1, activation='sigmoid')) # 출력층, 이진분류: sigmoid

2024-09-09 12:40:04.603996: I tensorflow/core/platform/cpu_feature_guard.cc:193] This TensorFlow binary is optimized with oneAPI Deep Neural Network Library (oneDNN) to use the following CPU instructions in performance-critical operations:  AVX2 FMA
To enable them in other operations, rebuild TensorFlow with the appropriate compiler flags.
2024-09-09 12:40:04.605860: I tensorflow/c/logging.cc:34] DirectML: creating device on adapter 0 (AMD Radeon(TM) RX Vega 11 Graphics)
2024-09-09 12:40:04.798012: I tensorflow/core/common_runtime/pluggable_device/pluggable_device_factory.cc:306] Could not identify NUMA node of platform GPU ID 0, defaulting to 0. Your kernel may not have been built with NUMA support.
2024-09-09 12:40:04.798105: W tensorflow/core/common_runtime/pluggable_device/pluggable_device_bfc_allocator.cc:28] Overriding allow_growth setting because force_memory_growth was requested by the device.
2024-09-09 12:40:04.798132: I tensorflow/core/common_runtime/pluggable_device/pluggable_device_factory.cc:272] Created TensorFlow device (/job:localhost/replica:0/task:0/device:GPU:0 with 15603 MB memory) -> physical PluggableDevice (device: 0, name: DML, pci bus id: <undefined>)

# 모델 파라미터 세팅 model.compile()
* loss: 오차 계산 지표 
  * 이진분류: binary_crossentropy
  * 다중분류: categorical_crossentropy
  * 데이터에 0이 많은 희소행렬인 경우: sparse_categorical_crossentropy
  * 연속형데이터(회귀분석): mse
* optimizer: learning_rate
  * adam 을 가장 많이 사용

In [ ]:
model.compile(loss='binary_crossentropy', optimizer='adam', metrics=['accuracy'])